src/InformationRegisters/ИС_WB_ДанныеОтчетовРеализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_ДанныеОтчетовРеализации</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>realizationreport_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>date_to</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>create_dt</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>rrd_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Иностранные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_ПараметрыОтчетовРеализации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_WB_ШтрихкодыРазмеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_ШтрихкодыРазмеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_WB_СоответствиеРазмеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_СоответствиеРазмеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазмерWB</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_Ozon_Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_Ozon_Продажи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦенаПродовцаСУчетомСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомиссияЗаПродажуПоКатегорииПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаРеализация</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЛояльностиРеализации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РеализованоНаСумму</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоплатаЗаСчетOzon</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИтогиКомиссияСУчетомСкидокИНаценок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИтогиКНачислению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозвратЦенаРеализации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЛояльностиВозврата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозвратКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозвращеноНаСумму</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозвратДоплатаЗаСчетOzon</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозвратИтогиКомиссияСУчетомСкидокИНаценок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИтогоВозвращено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОтправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЮрЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрАдресПокупателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>offer_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШтрихКодТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_Ozon_СоответствиеХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_Ozon_СоответствиеХарактеристик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураOzon</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ИС_MP_РаботаСОтчетами/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Заварин К.В. 25.10.24 УА #67817
Функция ПолучитьУпорядоченнуюТаблицуABCXYZ(Профиль, НачалоПериода, КонецПериода) Экспорт
	
	СтруктураТаблиц = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	ИС_WB_ДанныеОтчетовРеализации.rrd_id КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ИС_WB_ДанныеОтчетовРеализации.Значение = ""Возврат""
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Коэффициент,
	|	ИС_WB_ДанныеОтчетовРеализации.Значение КАК Операция,
	|	ИС_WB_ДанныеОтчетовРеализации.Профиль КАК Профиль
	|ПОМЕСТИТЬ ВТ_СтрокиПродаж
	|ИЗ
	|	РегистрСведений.ИС_WB_ДанныеОтчетовРеализации КАК ИС_WB_ДанныеОтчетовРеализации
	|ГДЕ
	|	ИС_WB_ДанныеОтчетовРеализации.Параметр.Наименование = ""supplier_oper_name""
	|	И (ИС_WB_ДанныеОтчетовРеализации.Значение = ""Продажа""
	|			ИЛИ ИС_WB_ДанныеОтчетовРеализации.Значение = ""Возврат"")
	|	И ИС_WB_ДанныеОтчетовРеализации.Период >= НАЧАЛОПЕРИОДА(&НачалоПериода, НЕДЕЛЯ)
	|	И ИС_WB_ДанныеОтчетовРеализации.date_to <= КОНЕЦПЕРИОДА(&КонецПериода, НЕДЕЛЯ)
	|	И ИС_WB_ДанныеОтчетовРеализации.Профиль В(&Профиль)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СтрокиПродаж.НомерСтроки КАК НомерСтроки,
	|	ВТ_СтрокиПродаж.Коэффициент КАК Коэффициент,
	|	ВТ_СтрокиПродаж.Операция КАК Операция,
	|	ВТ_СтрокиПродаж.Профиль КАК Профиль,
	|	ВЫРАЗИТЬ(ИС_WB_ДанныеОтчетовРеализации.Значение КАК ЧИСЛО(15, 2)) КАК Сумма
	|ПОМЕСТИТЬ ВТ_Суммы
	|ИЗ
	|	ВТ_СтрокиПродаж КАК ВТ_СтрокиПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ДанныеОтчетовРеализации КАК ИС_WB_ДанныеОтчетовРеализации
	|		ПО ВТ_СтрокиПродаж.НомерСтроки = ИС_WB_ДанныеОтчетовРеализации.rrd_id
	|			И (ИС_WB_ДанныеОтчетовРеализации.Параметр.Наименование = ""retail_amount"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Суммы.НомерСтроки КАК НомерСтроки,
	|	ВТ_Суммы.Коэффициент КАК Коэффициент,
	|	ВТ_Суммы.Операция КАК Операция,
	|	ВТ_Суммы.Сумма КАК Сумма,
	|	ВТ_Суммы.Профиль КАК Профиль,
	|	ИС_WB_ДанныеОтчетовРеализации.Значение КАК ДатаПродажи
	|ПОМЕСТИТЬ ВТ_Даты
	|ИЗ
	|	ВТ_Суммы КАК ВТ_Суммы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ДанныеОтчетовРеализации КАК ИС_WB_ДанныеОтчетовРеализации
	|		ПО ВТ_Суммы.НомерСтроки = ИС_WB_ДанныеОтчетовРеализации.rrd_id
	|			И (ИС_WB_ДанныеОтчетовРеализации.Параметр.Наименование = ""sale_dt"")
	|ГДЕ
	|	ИС_WB_ДанныеОтчетовРеализации.Значение МЕЖДУ &НачалоПериода И &КонецПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Даты.НомерСтроки КАК НомерСтроки,
	|	ВТ_Даты.Операция КАК Операция,
	|	ВТ_Даты.Коэффициент КАК Количество,
	|	ВТ_Даты.Сумма * ВТ_Даты.Коэффициент КАК Сумма,
	|	ИС_WB_ДанныеОтчетовРеализации.Значение КАК Штрихкод,
	|	ИС_WB_ШтрихкодыРазмеров.Размер КАК Размер,
	|	ВТ_Даты.Профиль КАК Профиль,
	|	МЕСЯЦ(НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(ВТ_Даты.ДатаПродажи КАК ДАТА), ДЕНЬ)) КАК ДатаПродажи
	|ПОМЕСТИТЬ ВТ_Размеры
	|ИЗ
	|	ВТ_Даты КАК ВТ_Даты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ДанныеОтчетовРеализации КАК ИС_WB_ДанныеОтчетовРеализации
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|			ПО (ИС_WB_ШтрихкодыРазмеров.Штрихкод = ИС_WB_ДанныеОтчетовРеализации.Значение)
	|		ПО ВТ_Даты.НомерСтроки = ИС_WB_ДанныеОтчетовРеализации.rrd_id
	|			И (ИС_WB_ДанныеОтчетовРеализации.Параметр.Наименование = ""barcode"")
	|ГДЕ
	|	НЕ ИС_WB_ШтрихкодыРазмеров.Размер ЕСТЬ NULL
	|	И ИС_WB_ШтрихкодыРазмеров.Профиль В(&Профиль)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_Размеры.Количество) КАК Количество,
	|	СУММА(ВТ_Размеры.Сумма) КАК Сумма,
	|	ВТ_Размеры.Штрихкод КАК Штрихкод,
	|	ВТ_Размеры.Размер КАК Размер,
	|	ВТ_Размеры.ДатаПродажи КАК ДатаПродажи,
	|	ВТ_Размеры.Профиль КАК Профиль,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
	|	ИС_WB_СоответствиеРазмеров.Характеристика КАК Характеристика,
	|	ЗНАЧЕНИЕ(Перечисление.ИС_МП_Маркетплейсы.ВБ) КАК Маркетплейс
	|ПОМЕСТИТЬ ВТ_СтрокиВБ
	|ИЗ
	|	ВТ_Размеры КАК ВТ_Размеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО ВТ_Размеры.Размер = ИС_WB_СоответствиеРазмеров.РазмерWB
	|ГДЕ
	|	НЕ ИС_WB_СоответствиеРазмеров.Номенклатура ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Размеры.Штрихкод,
	|	ВТ_Размеры.Размер,
	|	ВТ_Размеры.ДатаПродажи,
	|	ВТ_Размеры.Профиль,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура,
	|	ИС_WB_СоответствиеРазмеров.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_СтрокиВБ.Сумма) КАК Сумма,
	|	ВТ_СтрокиВБ.Профиль КАК Профиль
	|ПОМЕСТИТЬ ВТ_СуммаВБ
	|ИЗ
	|	ВТ_СтрокиВБ КАК ВТ_СтрокиВБ
	|ГДЕ
	|	ВТ_СтрокиВБ.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СтрокиВБ.Профиль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_Ozon_Продажи.offer_id КАК offer_id,
	|	ИС_Ozon_Продажи.SKU КАК SKU,
	|	ИС_Ozon_Продажи.Профиль КАК Профиль,
	|	ИС_Ozon_Продажи.НомерОтправления КАК НомерОтправления,
	|	ИС_Ozon_Продажи.Количество КАК Количество,
	|	ИС_Ozon_Продажи.РеализованоНаСумму КАК Сумма,
	|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
	|	ИС_Ozon_СоответствиеХарактеристик.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ИС_Ozon_Продажи.ДатаОтправления ЕСТЬ NULL
	|				ИЛИ ИС_Ozon_Продажи.ДатаОтправления = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВЫБОР
	|					КОГДА ИС_Ozon_Заказ.Дата ЕСТЬ NULL
	|							ИЛИ ИС_Ozon_Заказ.Дата = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ)
	|					ИНАЧЕ НАЧАЛОПЕРИОДА(ИС_Ozon_Заказ.Дата, ДЕНЬ)
	|				КОНЕЦ
	|		ИНАЧЕ ИС_Ozon_Продажи.ДатаОтправления
	|	КОНЕЦ КАК ДатаПродажи,
	|	ВЫБОР
	|		КОГДА ИС_Ozon_Заказ.Дата ЕСТЬ NULL
	|				ИЛИ ИС_Ozon_Заказ.Дата = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ""FBO""
	|		ИНАЧЕ ""FBS""
	|	КОНЕЦ КАК ТипПродажи,
	|	ЗНАЧЕНИЕ(Перечисление.ИС_МП_Маркетплейсы.Озон) КАК Маркетплейс
	|ПОМЕСТИТЬ ВТ_ПродажиОзон
	|ИЗ
	|	РегистрСведений.ИС_Ozon_Продажи КАК ИС_Ozon_Продажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
	|		ПО (ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.Профиль В (&Профиль))
	|			И (ИС_Ozon_Продажи.offer_id = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.offer_id
	|				ИЛИ ИС_Ozon_Продажи.SKU = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.sku_fbs
	|				ИЛИ ИС_Ozon_Продажи.SKU = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.sku_fbo)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
	|		ПО ИС_Ozon_Продажи.НомерОтправления = ИС_Ozon_Заказ.Номер
	|ГДЕ
	|	ИС_Ozon_Продажи.Профиль В(&Профиль)
	|	И ИС_Ozon_Продажи.ДатаНачала >= НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ)
	|	И НЕ ИС_Ozon_СоответствиеХарактеристик.Номенклатура ЕСТЬ NULL
	|	И ИС_Ozon_Продажи.ДатаОкончания <= КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|	И (ИС_Ozon_Продажи.ДатаОтправления МЕЖДУ &НачалоПериода И &КонецПериода
	|			ИЛИ ИС_Ozon_Продажи.ДатаОтправления = ДАТАВРЕМЯ(1, 1, 1))
	|	И ИС_Ozon_Продажи.Количество > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_Ozon_Продажи.offer_id,
	|	ИС_Ozon_Продажи.SKU,
	|	ИС_Ozon_Продажи.Профиль,
	|	ИС_Ozon_Продажи.НомерОтправления,
	|	-ИС_Ozon_Продажи.ВозвратКоличество,
	|	-ИС_Ozon_Продажи.ВозвращеноНаСумму,
	|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура,
	|	ИС_Ozon_СоответствиеХарактеристик.Характеристика,
	|	ВЫБОР
	|		КОГДА ИС_Ozon_Продажи.ДатаОтправления ЕСТЬ NULL
	|				ИЛИ ИС_Ozon_Продажи.ДатаОтправления = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВЫБОР
	|					КОГДА ИС_Ozon_Заказ.Дата ЕСТЬ NULL
	|							ИЛИ ИС_Ozon_Заказ.Дата = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ)
	|					ИНАЧЕ НАЧАЛОПЕРИОДА(ИС_Ozon_Заказ.Дата, ДЕНЬ)
	|				КОНЕЦ
	|		ИНАЧЕ ИС_Ozon_Продажи.ДатаОтправления
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИС_Ozon_Заказ.Дата ЕСТЬ NULL
	|				ИЛИ ИС_Ozon_Заказ.Дата = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ""FBO""
	|		ИНАЧЕ ""FBS""
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.ИС_МП_Маркетплейсы.Озон)
	|ИЗ
	|	РегистрСведений.ИС_Ozon_Продажи КАК ИС_Ozon_Продажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
	|		ПО (ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.Профиль В (&Профиль))
	|			И (ИС_Ozon_Продажи.offer_id = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.offer_id
	|				ИЛИ ИС_Ozon_Продажи.SKU = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.sku_fbs
	|				ИЛИ ИС_Ozon_Продажи.SKU = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.sku_fbo)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
	|		ПО ИС_Ozon_Продажи.НомерОтправления = ИС_Ozon_Заказ.Номер
	|ГДЕ
	|	ИС_Ozon_Продажи.Профиль В(&Профиль)
	|	И ИС_Ozon_Продажи.ДатаНачала >= НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ)
	|	И НЕ ИС_Ozon_СоответствиеХарактеристик.Номенклатура ЕСТЬ NULL
	|	И ИС_Ozon_Продажи.ДатаОкончания <= КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|	И (ИС_Ozon_Продажи.ДатаОтправления МЕЖДУ &НачалоПериода И &КонецПериода
	|			ИЛИ ИС_Ozon_Продажи.ДатаОтправления = ДАТАВРЕМЯ(1, 1, 1))
	|	И ИС_Ozon_Продажи.ВозвратКоличество > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПродажиОзон.offer_id КАК offer_id,
	|	ВТ_ПродажиОзон.SKU КАК SKU,
	|	ВТ_ПродажиОзон.Профиль КАК Профиль,
	|	ВТ_ПродажиОзон.НомерОтправления КАК НомерОтправления,
	|	ВТ_ПродажиОзон.Количество КАК Количество,
	|	ВТ_ПродажиОзон.Сумма КАК Сумма,
	|	ВТ_ПродажиОзон.Номенклатура КАК Номенклатура,
	|	ВТ_ПродажиОзон.Характеристика КАК Характеристика,
	|	ВТ_ПродажиОзон.ДатаПродажи КАК ДатаПродажи,
	|	ВТ_ПродажиОзон.ТипПродажи КАК ТипПродажи,
	|	ВТ_ПродажиОзон.Маркетплейс КАК Маркетплейс
	|ПОМЕСТИТЬ ВТ_ПозицииОзон
	|ИЗ
	|	ВТ_ПродажиОзон КАК ВТ_ПродажиОзон
	|ГДЕ
	|	ВТ_ПродажиОзон.ДатаПродажи МЕЖДУ &НачалоПериода И &КонецПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПозицииОзон.Номенклатура КАК Номенклатура,
	|	ВТ_ПозицииОзон.Характеристика КАК Характеристика,
	|	СУММА(ВТ_ПозицииОзон.Количество) КАК Количество,
	|	СУММА(ВТ_ПозицииОзон.Сумма) КАК Сумма,
	|	ВТ_ПозицииОзон.Профиль КАК Профиль,
	|	ВТ_ПозицииОзон.Маркетплейс КАК Маркетплейс,
	|	МЕСЯЦ(ВТ_ПозицииОзон.ДатаПродажи) КАК ДатаПродажи
	|ПОМЕСТИТЬ ВТ_СтрокиОзон
	|ИЗ
	|	ВТ_ПозицииОзон КАК ВТ_ПозицииОзон
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПозицииОзон.Номенклатура,
	|	ВТ_ПозицииОзон.Характеристика,
	|	ВТ_ПозицииОзон.Профиль,
	|	ВТ_ПозицииОзон.Маркетплейс,
	|	ВТ_ПозицииОзон.ДатаПродажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СтрокиОзон.Маркетплейс КАК Маркетплейс,
	|	СУММА(ВТ_СтрокиОзон.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_СуммаОзон
	|ИЗ
	|	ВТ_СтрокиОзон КАК ВТ_СтрокиОзон
	|ГДЕ
	|	ВТ_СтрокиОзон.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СтрокиОзон.Маркетплейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_ЯМ_Продажи.Sku КАК Sku,
	|	ИС_ЯМ_Продажи.НомерЗаказа КАК НомерЗаказа,
	|	ИС_ЯМ_Продажи.Количество КАК Количество,
	|	ИС_ЯМ_Продажи.РеализованоНаСумму КАК Сумма,
	|	ИС_ЯМ_Продажи.ДатаОформленияЗаказа КАК ДатаПродажи,
	|	ИС_ЯМ_Продажи.Профиль КАК Профиль,
	|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
	|	ИС_ЯМ_СоответствиеХарактеристик.Характеристика КАК Характеристика,
	|	ЗНАЧЕНИЕ(Перечисление.ИС_МП_Маркетплейсы.ЯМ) КАК Маркетплейс
	|ПОМЕСТИТЬ ВТ_ПродажиЯМ
	|ИЗ
	|	РегистрСведений.ИС_ЯМ_Продажи КАК ИС_ЯМ_Продажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СоответствиеХарактеристик КАК ИС_ЯМ_СоответствиеХарактеристик
	|		ПО ИС_ЯМ_Продажи.Sku = ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.shopSku
	|			И (ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.Профиль В (&Профиль))
	|ГДЕ
	|	ИС_ЯМ_Продажи.Профиль В(&Профиль)
	|	И ИС_ЯМ_Продажи.ДатаОформленияЗаказа МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ИС_ЯМ_Продажи.Количество > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_ЯМ_Продажи.Sku,
	|	ИС_ЯМ_Продажи.НомерЗаказа,
	|	-ИС_ЯМ_Продажи.ВозвратКоличество,
	|	-ИС_ЯМ_Продажи.ВозвращеноНаСумму,
	|	ИС_ЯМ_Продажи.ДатаОформленияЗаказа,
	|	ИС_ЯМ_Продажи.Профиль,
	|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура,
	|	ИС_ЯМ_СоответствиеХарактеристик.Характеристика,
	|	ЗНАЧЕНИЕ(Перечисление.ИС_МП_Маркетплейсы.ЯМ)
	|ИЗ
	|	РегистрСведений.ИС_ЯМ_Продажи КАК ИС_ЯМ_Продажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СоответствиеХарактеристик КАК ИС_ЯМ_СоответствиеХарактеристик
	|		ПО ИС_ЯМ_Продажи.Sku = ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.shopSku
	|			И (ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.Профиль В (&Профиль))
	|ГДЕ
	|	ИС_ЯМ_Продажи.Профиль В(&Профиль)
	|	И ИС_ЯМ_Продажи.ДатаОформленияЗаказа МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ИС_ЯМ_Продажи.ВозвратКоличество > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПродажиЯМ.Sku КАК Sku,
	|	ВТ_ПродажиЯМ.Профиль КАК Профиль,
	|	ВТ_ПродажиЯМ.НомерЗаказа КАК НомерЗаказа,
	|	ВТ_ПродажиЯМ.Количество КАК Количество,
	|	ВТ_ПродажиЯМ.Сумма КАК Сумма,
	|	МЕСЯЦ(ВТ_ПродажиЯМ.ДатаПродажи) КАК ДатаПродажи,
	|	ВТ_ПродажиЯМ.Номенклатура КАК Номенклатура,
	|	ВТ_ПродажиЯМ.Характеристика КАК Характеристика,
	|	ВТ_ПродажиЯМ.Маркетплейс КАК Маркетплейс
	|ПОМЕСТИТЬ ВТ_ПозицииЯМ
	|ИЗ
	|	ВТ_ПродажиЯМ КАК ВТ_ПродажиЯМ
	|ГДЕ
	|	ВТ_ПродажиЯМ.Сумма <> 0
	|	И НЕ ВТ_ПродажиЯМ.Номенклатура ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПозицииЯМ.Номенклатура КАК Номенклатура,
	|	ВТ_ПозицииЯМ.Характеристика КАК Характеристика,
	|	СУММА(ВТ_ПозицииЯМ.Количество) КАК Количество,
	|	ВТ_ПозицииЯМ.Профиль КАК Профиль,
	|	СУММА(ВТ_ПозицииЯМ.Сумма) КАК Сумма,
	|	ВТ_ПозицииЯМ.Маркетплейс КАК Маркетплейс,
	|	ВТ_ПозицииЯМ.ДатаПродажи КАК ДатаПродажи
	|ПОМЕСТИТЬ ВТ_СтрокиЯМ
	|ИЗ
	|	ВТ_ПозицииЯМ КАК ВТ_ПозицииЯМ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПозицииЯМ.Номенклатура,
	|	ВТ_ПозицииЯМ.Характеристика,
	|	ВТ_ПозицииЯМ.Маркетплейс,
	|	ВТ_ПозицииЯМ.ДатаПродажи,
	|	ВТ_ПозицииЯМ.Профиль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СтрокиЯМ.Маркетплейс КАК Маркетплейс,
	|	СУММА(ВТ_СтрокиЯМ.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_СуммаЯМ
	|ИЗ
	|	ВТ_СтрокиЯМ КАК ВТ_СтрокиЯМ
	|ГДЕ
	|	ВТ_СтрокиЯМ.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СтрокиЯМ.Маркетплейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_Сбер_Продажи.Артикул КАК Артикул,
	|	ИС_Сбер_Продажи.СтрокаНомер КАК СтрокаНомер,
	|	ИС_Сбер_Продажи.Количество КАК Количество,
	|	ИС_Сбер_Продажи.ЦенаПродажи КАК ЦенаПродажи,
	|	ИС_Сбер_Продажи.ДатаОтправления КАК ДатаОтправления,
	|	ИС_Сбер_Продажи.Профиль КАК Профиль,
	|	ИС_Сбер_Товары.Номенклатура КАК Номенклатура,
	|	ИС_Сбер_Товары.Характеристика КАК Характеристика,
	|	ЗНАЧЕНИЕ(Перечисление.ИС_МП_Маркетплейсы.Сбер) КАК Маркетплейс
	|ПОМЕСТИТЬ ВТ_ПродажиСбер
	|ИЗ
	|	РегистрСведений.ИС_Сбер_Продажи КАК ИС_Сбер_Продажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Сбер_Товары КАК ИС_Сбер_Товары
	|		ПО ИС_Сбер_Продажи.Артикул = ИС_Сбер_Товары.offerID
	|			И (ИС_Сбер_Товары.ЛичныйКабинет В (&Профиль))
	|ГДЕ
	|	ИС_Сбер_Продажи.Профиль В(&Профиль)
	|	И ИС_Сбер_Продажи.ДатаОтправления МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ИС_Сбер_Продажи.Количество > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИС_Сбер_Продажи.Артикул,
	|	ИС_Сбер_Продажи.СтрокаНомер,
	|	ИС_Сбер_Продажи.Количество,
	|	-ИС_Сбер_Продажи.ЦенаПродажи,
	|	ИС_Сбер_Продажи.ДатаОтправления,
	|	ИС_Сбер_Продажи.Профиль,
	|	ИС_Сбер_Товары.Номенклатура,
	|	ИС_Сбер_Товары.Характеристика,
	|	ЗНАЧЕНИЕ(Перечисление.ИС_МП_Маркетплейсы.Сбер)
	|ИЗ
	|	РегистрСведений.ИС_Сбер_Продажи КАК ИС_Сбер_Продажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Сбер_Товары КАК ИС_Сбер_Товары
	|		ПО ИС_Сбер_Продажи.Артикул = ИС_Сбер_Товары.offerID
	|			И (ИС_Сбер_Товары.ЛичныйКабинет В (&Профиль))
	|ГДЕ
	|	ИС_Сбер_Продажи.Профиль В(&Профиль)
	|	И ИС_Сбер_Продажи.ДатаОтправления МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ИС_Сбер_Продажи.Количество < 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПродажиСбер.Артикул КАК Sku,
	|	ВТ_ПродажиСбер.Профиль КАК Профиль,
	|	ВТ_ПродажиСбер.СтрокаНомер КАК СтрокаНомер,
	|	ВТ_ПродажиСбер.Количество КАК Количество,
	|	ВТ_ПродажиСбер.ЦенаПродажи КАК ЦенаПродажи,
	|	МЕСЯЦ(ВТ_ПродажиСбер.ДатаОтправления) КАК ДатаОтправления,
	|	ВТ_ПродажиСбер.Номенклатура КАК Номенклатура,
	|	ВТ_ПродажиСбер.Характеристика КАК Характеристика,
	|	ВТ_ПродажиСбер.Маркетплейс КАК Маркетплейс
	|ПОМЕСТИТЬ ВТ_ПозицииСбер
	|ИЗ
	|	ВТ_ПродажиСбер КАК ВТ_ПродажиСбер
	|ГДЕ
	|	ВТ_ПродажиСбер.ЦенаПродажи <> 0
	|	И НЕ ВТ_ПродажиСбер.Номенклатура ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПозицииСбер.Номенклатура КАК Номенклатура,
	|	ВТ_ПозицииСбер.Профиль КАК Профиль,
	|	ВТ_ПозицииСбер.Характеристика КАК Характеристика,
	|	СУММА(ВТ_ПозицииСбер.Количество) КАК Количество,
	|	СУММА(ВТ_ПозицииСбер.ЦенаПродажи) КАК Сумма,
	|	ВТ_ПозицииСбер.Маркетплейс КАК Маркетплейс,
	|	ВТ_ПозицииСбер.ДатаОтправления КАК ДатаОтправления
	|ПОМЕСТИТЬ ВТ_СтрокиСбер
	|ИЗ
	|	ВТ_ПозицииСбер КАК ВТ_ПозицииСбер
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПозицииСбер.Номенклатура,
	|	ВТ_ПозицииСбер.Характеристика,
	|	ВТ_ПозицииСбер.Маркетплейс,
	|	ВТ_ПозицииСбер.ДатаОтправления,
	|	ВТ_ПозицииСбер.Профиль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СтрокиСбер.Маркетплейс КАК Маркетплейс,
	|	СУММА(ВТ_СтрокиСбер.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_СуммаСбер
	|ИЗ
	|	ВТ_СтрокиСбер КАК ВТ_СтрокиСбер
	|ГДЕ
	|	ВТ_СтрокиСбер.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СтрокиСбер.Маркетплейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_СтрокиВБ.Номенклатура ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_СтрокиОзон.Номенклатура ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_СтрокиЯМ.Номенклатура ЕСТЬ NULL
	|									ТОГДА ВТ_СтрокиСбер.Номенклатура
	|								ИНАЧЕ ВТ_СтрокиЯМ.Номенклатура
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_СтрокиОзон.Номенклатура
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_СтрокиВБ.Номенклатура
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ВТ_СтрокиВБ.Характеристика ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_СтрокиОзон.Характеристика ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_СтрокиЯМ.Характеристика ЕСТЬ NULL
	|									ТОГДА ВТ_СтрокиСбер.Характеристика
	|								ИНАЧЕ ВТ_СтрокиЯМ.Характеристика
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_СтрокиОзон.Характеристика
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_СтрокиВБ.Характеристика
	|	КОНЕЦ КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ВТ_СтрокиВБ.Профиль ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_СтрокиОзон.Профиль ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_СтрокиЯМ.Профиль ЕСТЬ NULL
	|									ТОГДА ВТ_СтрокиСбер.Профиль
	|								ИНАЧЕ ВТ_СтрокиЯМ.Профиль
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_СтрокиОзон.Профиль
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_СтрокиВБ.Профиль
	|	КОНЕЦ КАК Профиль
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	ВТ_СтрокиВБ КАК ВТ_СтрокиВБ
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_СтрокиОзон КАК ВТ_СтрокиОзон
	|		ПО ВТ_СтрокиВБ.Номенклатура = ВТ_СтрокиОзон.Номенклатура
	|			И ВТ_СтрокиВБ.Характеристика = ВТ_СтрокиОзон.Характеристика
	|			И ВТ_СтрокиВБ.Профиль = ВТ_СтрокиОзон.Профиль
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_СтрокиЯМ КАК ВТ_СтрокиЯМ
	|		ПО ВТ_СтрокиВБ.Номенклатура = ВТ_СтрокиЯМ.Номенклатура
	|			И ВТ_СтрокиВБ.Характеристика = ВТ_СтрокиЯМ.Характеристика
	|			И ВТ_СтрокиВБ.Профиль = ВТ_СтрокиЯМ.Профиль
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_СтрокиСбер КАК ВТ_СтрокиСбер
	|		ПО ВТ_СтрокиВБ.Номенклатура = ВТ_СтрокиСбер.Номенклатура
	|			И ВТ_СтрокиВБ.Характеристика = ВТ_СтрокиСбер.Характеристика
	|			И ВТ_СтрокиВБ.Профиль = ВТ_СтрокиСбер.Профиль
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ВТ_СтрокиВБ.Номенклатура ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_СтрокиОзон.Номенклатура ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_СтрокиЯМ.Номенклатура ЕСТЬ NULL
	|									ТОГДА ВТ_СтрокиСбер.Номенклатура
	|								ИНАЧЕ ВТ_СтрокиЯМ.Номенклатура
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_СтрокиОзон.Номенклатура
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_СтрокиВБ.Номенклатура
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТ_СтрокиВБ.Характеристика ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_СтрокиОзон.Характеристика ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_СтрокиЯМ.Характеристика ЕСТЬ NULL
	|									ТОГДА ВТ_СтрокиСбер.Характеристика
	|								ИНАЧЕ ВТ_СтрокиЯМ.Характеристика
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_СтрокиОзон.Характеристика
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_СтрокиВБ.Характеристика
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТ_СтрокиВБ.Профиль ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_СтрокиОзон.Профиль ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_СтрокиЯМ.Профиль ЕСТЬ NULL
	|									ТОГДА ВТ_СтрокиСбер.Профиль
	|								ИНАЧЕ ВТ_СтрокиЯМ.Профиль
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_СтрокиОзон.Профиль
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_СтрокиВБ.Профиль
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Характеристика КАК Характеристика,
	|	ВТ_СтрокиВБ.Маркетплейс КАК Маркетплейс,
	|	ВТ_СтрокиВБ.Количество КАК Количество,
	|	ВТ_СтрокиВБ.Сумма КАК Сумма,
	|	ВТ_СтрокиВБ.Профиль КАК Профиль,
	|	ВТ_СуммаВБ.Сумма КАК СуммаОбщая,
	|	ВТ_СтрокиВБ.Сумма / ВТ_СуммаВБ.Сумма * 100 КАК ДоляПродаж,
	|	ВТ_СтрокиВБ.ДатаПродажи КАК ДатаПродажи
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтрокиВБ КАК ВТ_СтрокиВБ
	|		ПО ВТ_Номенклатура.Номенклатура = ВТ_СтрокиВБ.Номенклатура
	|			И ВТ_Номенклатура.Характеристика = ВТ_СтрокиВБ.Характеристика
	|			И ВТ_Номенклатура.Профиль = ВТ_СтрокиВБ.Профиль,
	|	ВТ_СуммаВБ КАК ВТ_СуммаВБ
	|ГДЕ
	|	ВТ_СтрокиВБ.Количество > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Номенклатура,
	|	ВТ_Номенклатура.Характеристика,
	|	ВТ_СтрокиОзон.Маркетплейс,
	|	ВТ_СтрокиОзон.Количество,
	|	ВТ_СтрокиОзон.Сумма,
	|	ВТ_СтрокиОзон.Профиль,
	|	ВТ_СуммаОзон.Сумма,
	|	ВТ_СтрокиОзон.Сумма / ВТ_СуммаОзон.Сумма * 100,
	|	ВТ_СтрокиОзон.ДатаПродажи
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтрокиОзон КАК ВТ_СтрокиОзон
	|		ПО ВТ_Номенклатура.Номенклатура = ВТ_СтрокиОзон.Номенклатура
	|			И ВТ_Номенклатура.Характеристика = ВТ_СтрокиОзон.Характеристика
	|			И ВТ_Номенклатура.Профиль = ВТ_СтрокиОзон.Профиль,
	|	ВТ_СуммаОзон КАК ВТ_СуммаОзон
	|ГДЕ
	|	ВТ_СтрокиОзон.Количество > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Номенклатура,
	|	ВТ_Номенклатура.Характеристика,
	|	ВТ_СтрокиЯМ.Маркетплейс,
	|	ВТ_СтрокиЯМ.Количество,
	|	ВТ_СтрокиЯМ.Сумма,
	|	ВТ_СтрокиЯМ.Профиль,
	|	ВТ_СуммаЯМ.Сумма,
	|	ВТ_СтрокиЯМ.Сумма / ВТ_СуммаЯМ.Сумма * 100,
	|	ВТ_СтрокиЯМ.ДатаПродажи
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтрокиЯМ КАК ВТ_СтрокиЯМ
	|		ПО ВТ_Номенклатура.Номенклатура = ВТ_СтрокиЯМ.Номенклатура
	|			И ВТ_Номенклатура.Характеристика = ВТ_СтрокиЯМ.Характеристика
	|			И ВТ_Номенклатура.Профиль = ВТ_СтрокиЯМ.Профиль,
	|	ВТ_СуммаЯМ КАК ВТ_СуммаЯМ
	|ГДЕ
	|	ВТ_СтрокиЯМ.Количество > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Номенклатура,
	|	ВТ_Номенклатура.Характеристика,
	|	ВТ_СтрокиСбер.Маркетплейс,
	|	ВТ_СтрокиСбер.Количество,
	|	ВТ_СтрокиСбер.Сумма,
	|	ВТ_СтрокиСбер.Профиль,
	|	ВТ_СуммаСбер.Сумма,
	|	ВТ_СтрокиСбер.Сумма / ВТ_СуммаСбер.Сумма * 100,
	|	ВТ_СтрокиСбер.ДатаОтправления
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтрокиСбер КАК ВТ_СтрокиСбер
	|		ПО ВТ_Номенклатура.Номенклатура = ВТ_СтрокиСбер.Номенклатура
	|			И ВТ_Номенклатура.Характеристика = ВТ_СтрокиСбер.Характеристика
	|			И ВТ_Номенклатура.Профиль = ВТ_СтрокиСбер.Профиль,
	|	ВТ_СуммаСбер КАК ВТ_СуммаСбер
	|ГДЕ
	|	ВТ_СтрокиСбер.Количество > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Маркетплейс,
	|	ДоляПродаж УБЫВ";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	
	Результат = Запрос.Выполнить();
	
	УпорядоченнаяТаблица = Результат.Выгрузить();
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_Таблица.Номенклатура КАК Номенклатура,
	|	ВТ_Таблица.Характеристика КАК Характеристика,
	|	ВТ_Таблица.Количество КАК Количество,
	|	ВТ_Таблица.Сумма КАК Сумма,
	|	ВТ_Таблица.Профиль КАК Профиль,
	|	ВТ_Таблица.Маркетплейс КАК Маркетплейс,
	|	ВТ_Таблица.СуммаОбщая КАК СуммаОбщая,
	|	ВТ_Таблица.ДоляПродаж КАК ДоляПродаж,
	|	ВТ_Таблица.ДатаПродажи КАК ДатаПродажи
	|ПОМЕСТИТЬ ВТ_ТаблицаПолученная
	|ИЗ
	|	&ТЗ КАК ВТ_Таблица
	|;
	|	
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПолученная.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаПолученная.Характеристика КАК Характеристика,
	|	ВТ_ТаблицаПолученная.Маркетплейс КАК Маркетплейс,
	|	СУММА(ВТ_ТаблицаПолученная.Количество) КАК Количество,
	|	СУММА(ВТ_ТаблицаПолученная.Сумма) КАК Сумма,
	|	ВТ_ТаблицаПолученная.Профиль КАК Профиль,
	|	ВТ_ТаблицаПолученная.СуммаОбщая КАК СуммаОбщая,
	|	СУММА(ВТ_ТаблицаПолученная.ДоляПродаж) КАК ДоляПродаж,
	|	СУММА(ВТ_ТаблицаПолученная.ДатаПродажи) КАК ДатаПродажи
	|ПОМЕСТИТЬ ВТ_Основной
	|ИЗ
	|	ВТ_ТаблицаПолученная КАК ВТ_ТаблицаПолученная
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаПолученная.Номенклатура,
	|	ВТ_ТаблицаПолученная.Характеристика,
	|	ВТ_ТаблицаПолученная.Маркетплейс,
	|	ВТ_ТаблицаПолученная.Профиль,
	|	ВТ_ТаблицаПолученная.СуммаОбщая    
	|;
	|		
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основной.Номенклатура КАК Номенклатура,
	|	ВТ_Основной.Характеристика КАК Характеристика,
	|	ВТ_Основной.Количество КАК Количество,
	|	ВТ_Основной.Сумма КАК Сумма,
	|	ВТ_Основной.Профиль КАК Профиль,
	|	ВТ_Основной.Маркетплейс КАК Маркетплейс,
	|	ВТ_Основной.СуммаОбщая КАК СуммаОбщая,
	|	ВТ_Основной.ДоляПродаж КАК ДоляПродаж,
	|	СУММА(ВТ_Вспомогательный.ДоляПродаж) КАК НарастающийИтог
	|ПОМЕСТИТЬ ВТ_НарастающийИтог
	|ИЗ
	|	ВТ_Основной КАК ВТ_Основной
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Основной КАК ВТ_Вспомогательный  
	|		ПО ВТ_Основной.ДоляПродаж 	 	 <= ВТ_Вспомогательный.ДоляПродаж
	|			И ВТ_Основной.Маркетплейс 	  = ВТ_Вспомогательный.Маркетплейс
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Основной.Номенклатура,
	|	ВТ_Основной.Характеристика,
	|	ВТ_Основной.Маркетплейс,
	|	ВТ_Основной.Количество,
	|	ВТ_Основной.Сумма,
	|	ВТ_Основной.Профиль,
	|	ВТ_Основной.СуммаОбщая,
	|	ВТ_Основной.ДоляПродаж
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НарастающийИтог.Номенклатура КАК НоменклатураНИ,
	|	ВТ_НарастающийИтог.Характеристика КАК ХарактеристикаНИ,
	|	ВТ_НарастающийИтог.Количество КАК КоличествоНИ,
	|	ВТ_НарастающийИтог.Сумма КАК СуммаНИ,
	|	ВТ_НарастающийИтог.Профиль КАК ПрофильНИ,
	|	ВТ_НарастающийИтог.Маркетплейс КАК МаркетплейсНИ,
	|	ВТ_НарастающийИтог.СуммаОбщая КАК СуммаОбщаяНИ,
	|	ВТ_НарастающийИтог.ДоляПродаж КАК ДоляПродажНИ,
	|	ВТ_НарастающийИтог.НарастающийИтог КАК СовокупныйПроцент
	|ИЗ
	|	ВТ_НарастающийИтог КАК ВТ_НарастающийИтог
	|
	|УПОРЯДОЧИТЬ ПО
	|	Маркетплейс,
	|	ДоляПродаж УБЫВ"; 
	
	Запрос.УстановитьПараметр("ТЗ", УпорядоченнаяТаблица);
	
	РезультатНарастающийИтог = Запрос.Выполнить();
	
	НарастающийИтогТаблица = РезультатНарастающийИтог.Выгрузить();
	
	СтруктураТаблиц.Вставить("УпорядоченнаяТаблица",   УпорядоченнаяТаблица);
	СтруктураТаблиц.Вставить("НарастающийИтогТаблица", НарастающийИтогТаблица);
	
	Возврат	СтруктураТаблиц;
	
КонецФункции //- ИнфоСофт Заварин К.В. 25.10.24 УА #67817

#КонецОбласти
